#1. Напишите программу, которая принимает
# на вход цифру, обозначающую день недели, и
# проверяет, является ли этот день выходным.
#*Пример:*

#- 6 -> да
#- 7 -> да
#- 1 -> нет

print("Является день выходным?")
n = int(input())
if (n >= 1 and n <= 5):
    print("Рабочий день")
elif (n == 6):
    print("Выходной день")
elif (n == 7):
    print("Выходной день")
else:
    print("Ошибка, не существует данного дня")

#2. Напишите программу для проверки ложности утверждения
#(W ⋀ Z) ⋁ ¬Y ⋁ (¬X ≡ ¬W) для всех значений предикат.
print("W X Y Z")
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if (w and z or not y or not x == w):
                    print(w, x, y, z)
