#1. Напишите программу, которая принимает
# на вход цифру, обозначающую день недели, и
# проверяет, является ли этот день выходным.
#*Пример:*

#- 6 -> да
#- 7 -> да
#- 1 -> нет

print("Является день выходным?")
n = int(input())
if (n >= 1 and n <= 5):
    print("Рабочий день")
elif (n == 6):
    print("Выходной день")
elif (n == 7):
    print("Выходной день")
else:
    print("Ошибка, не существует данного дня")

#2. Напишите программу для проверки ложности утверждения
#(W ⋀ Z) ⋁ ¬Y ⋁ (¬X ≡ ¬W) для всех значений предикат.
print("W X Y Z")
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if (w and z or not y or not x == w):
                    print(w, x, y, z)



#3. Напишите программу, которая принимает на вход
# координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и
# выдаёт номер четверти плоскости, в которой находится эта
# точка (или на какой оси она находится).
#- x=34; y=-30 -> 4
#- x=2; y=4-> 1
#- x=-34; y=-30 -> 3

print("Введите координаты:")
print("X:")
x = int(input())
print("Y:")
y = int(input())


if x > 0 and y > 0:
    print("Первая четверть")
elif x < 0 and y > 0:
    print("Вторая четверть")
elif x < -0 and y < -0:
    print("Третья четверть")
elif x > 0 and y < 0:
    print("Четвертая четверть")
else:
    print("Точка лежит на координате оси")


    #4. Напишите программу, которая по заданному
# номеру четверти, показывает диапазон возможных
# координат точек в этой четверти (x и y).

#- 1 -> x > 0, y > 0
#- 8 -> нет такой четверти


print("Введите координаты:")
print("ОСЬ:")
o = int(input())



if o == 1:
    print("Первая четверть x > 0 и y > 0:")
elif o == 2:
        print("Вторая четверть x < 0 и y > 0")
elif o == 3:
        print("Третья четверть x < 0 и y < 0")
elif o == 4:
        print("Четвертая четверть x > 0 и y < 0")
else:
    print("Нет такой четверти")


#5. Напишите программу, которая принимает на вход координаты
# двух точек и находит расстояние между ними в 2D пространстве
# . https://ru.onlinemschool.com/math/library/analytic_geometry/point_point_length/
#in
#- 3
#- 6
#- 2
#- 1
#out
#5.099
import math
print("Найти разницу между 2 точка координат:")
print("Введите координаты:")
print("X1:")
x1 = float(input())
print("Y1:")
y1 = float(input())

print("X2:")
x2 = float(input())
print("Y2:")
y2 = float(input())

print(round(math.sqrt((x2-x1)**2 + (y2-y1)**2), 3))